app/views/issues/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :Assignee %>
    <%= form.collection_select :assignee_id, User.all, :id, :name, {:include_blank => 'No assigned user'} %>