app/views/issues/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% if request.query_parameters[:assignee_id] %>
        <b>assignee:</b> "<%= User.find(request.query_parameters[:assignee_id]).name %>"

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <% if !issue.assignee_id.nil? %>
            <td><%= link_to User.find(issue.assignee_id).name, issues_url(assignee_id: issue.assignee_id) , class:"btn-link" %></td>

SELECT 1 AS one FROM "watchers" WHERE "watchers"."issue_id" = ? AND "watchers"."user_id" = ? LIMIT ?  [["issue_id", 10], ["user_id", 1], ["LIMIT", 1]]
---
            <% if current_user %>
              <% if !Watcher.exists?(:issue_id => issue.id, :user_id => current_user.id) %>