app/views/issues/show.html.erb

  <div>
    <p><strong> <%= User.find(@issue.user_id).name %> </strong> created an issue <small><font color="gray"><%= time_ago_in_words(@issue.created_at) + " ago" %></font></small></p>
---
INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-30 14:30:52.375054"], ["updated_at", "2019-11-30 14:30:52.375054"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <div class="col-md-8">
        <h2>Comentarios (<%= @issue.comments.count %>)</h2>

        <% @issue.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."issue_id" = ? ORDER BY "comments"."created_at" ASC  [["issue_id", 11]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."issue_id" = ?  [["issue_id", 11]]

            <p> <% if comment.user_id == current_user.id%>
                <%= link_to 'Delete ', [Issue.find(comment.issue_id), comment],
                            method: :delete,
                            data: { confirm: 'Are you sure?' } , class: "destroy" %> .
              <% end %>
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? ORDER BY "issues"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <td  class = "label-list">Votes</td>
        <td class = link-list> <%= @issue.votes.size %>
          <% if !Vote.exists?(:issue_id => @issue.id, :user_id => current_user.id) %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."issue_id" = ?  [["issue_id", 11]]
SELECT 1 AS one FROM "votes" WHERE "votes"."issue_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["issue_id", 11], ["user_id", 1], ["LIMIT", 1]]

        <td class = link-list><%= @issue.Watchers %>
          <% if !Watcher.exists?(:issue_id => @issue.id, :user_id => current_user.id) %>
---
SELECT 1 AS one FROM "watchers" WHERE "watchers"."issue_id" = ? AND "watchers"."user_id" = ? LIMIT ?  [["issue_id", 11], ["user_id", 1], ["LIMIT", 1]]