app/controllers/application_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-30 14:25:30.430885"], ["updated_at", "2019-11-30 14:25:30.430885"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_current_user
    User.create()
    if User.find(1)
  	  @user = User.find(1)