app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."Type" = ?  [["Type", "Bug"]]
SELECT "issues".* FROM "issues" WHERE "issues"."Priority" = ?  [["Priority", "Minor"]]
SELECT "issues".* FROM "issues" WHERE "issues"."Status" = ? ORDER BY "issues"."created_at" DESC  [["Status", "Open"]]
---
  def index
    @issues = Issue.all.order(sort_column + ' ' + sort_direction)
    @issues = @issues.where(Type: params[:Type]) if params[:Type]
    @issues = @issues.where(Priority: params[:Priority]) if params[:Priority]
    @issues = @issues.where(Status: params[:Status]) if params[:Status]

SELECT 1 AS one FROM "watchers" WHERE "watchers"."issue_id" = ? AND "watchers"."user_id" = ? LIMIT ?  [["issue_id", 10], ["user_id", 1], ["LIMIT", 1]]
---
      end

      if params.has_key?(:watcher)
        if User.exists?(id: params[:watcher])

INSERT INTO "issues" ("Title", "Description", "Type", "Priority", "Status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["Title", "ddd"], ["Description", "ddd"], ["Type", 0], ["Priority", 0], ["Status", "Open"], ["created_at", "2019-11-20 16:18:49.101304"], ["updated_at", "2019-11-20 16:18:49.101304"]]
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save

SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."issue_id" = ?  [["issue_id", 3]]
---
  def vote
        respond_to do |format|
          @issue_to_vote = Issue.find(params[:id])
          if !Vote.exists?(:issue_id => @issue_to_vote.id, :user_id => 1)

DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 1]]
---
  def destroy
    @issue.destroy

SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_issue
      @issue = Issue.find(params[:id])