app/controllers/issues_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-30 14:30:52.355854"], ["updated_at", "2019-11-30 14:30:52.355854"]]
---
  def create
    @issue = Issue.new(issue_params)
    @issue.user_id = current_user.id
    respond_to do |format|
      if @issue.save