app/controllers/issues_controller.rb

  def destroy
    @issue.destroy
---
DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 3]]