app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Amanda"], ["email", "ss@gmail.com"], ["created_at", "2019-11-21 02:16:22.308145"], ["updated_at", "2019-11-21 02:16:22.308145"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save